#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "94c60b5527f8daeca5df0197abf2cd75" -> "852919656bdce9743b03718b1b1acd39"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "79232d6554dd2eb5f679253ee7af430f" -> "7bc52df50a4b2b0dad894b20e466ec12"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "92c67221f6394b6e9bbfb95508d3c6ce" -> "f6cf96330fde2c3a0cbab220f4874056"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "a68c2e53325f5c05862c4d84c47ae9c0" -> "3a391d0b829277e2922889b0ce320cf0"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "e8dc435a768174e901f4a37bd61cdb6d" -> "668bafe850bb3f88b8cdee0a875db6b9"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "58205e3b9fa0e62b1b0775101a3ba0dd" -> "5725c4f2f5a926f0d37d5e31bbfdfc5b"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "9ac3498f6b2f3552df4e64b10d5475a9" -> "0d2572fb54c5bceeea1bcb7fbff3f5e2"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "85e2799416bd4715be28288fe2dec60b" -> "567ce8b049fabaae0389009566c9ce0b"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "f1f8577270136526874ceea613849d1e" -> "88e26f024d8c6381763bf11d87cf2549"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "f5f0153011f71e2eb80a234246dbe9e6" -> "b35c9f5401a6a4845df40655e3ed6d21"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "82bf48486c047e70101bc24943a9f108" -> "ff7ad2e3e81611c71814d11e5c6f42ac"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "b2368f743c68c7cddb6283fb0d0facf9" -> "b60423bc14bc12d82321d1e2b1aa9651"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "13c25d7a06c5a9795bec7a0cbd2a3f1c" -> "e3bed23c9d64d25d4a29dbf325634742"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "42b3eb42cf1380d7c58c0f5a88c1cb31" -> "8414434dbf51ee2d27779c95dea5cef0"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "f4defa5d6b0c8c853c3a6c5ac7bb1773" -> "80932976b7f1ab5a696b7dd01fc04d86"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "78c2768b42fe54c72799542ff0608a46" -> "129fa1640dede807fcbff6a1f0b6d7de"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "6b970aae15cc1510ce2eda596197203d" -> "ad434ae83bfc8d1dc76e64368d071b9a"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "d1d4d996c5a4bb9e858e6eda9db603d0" -> "af949e278e899b079c8f4b78a5fe1ce2"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "3b596fdff9a475ebae6c6ed41052b4f1" -> "f5456329b4240ebaa35f0ed2097dde24"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "afea37fed800073c2359301664153a40" -> "eafb5d72018d98f3abef1db8eb49bdad"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "c62398c5f9140362264038e01a55ed93" -> "cc778a410cb3a3ef859c69bf5bb20eb0"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "2a7d5dfd2536f33d88819e34f7403919" -> "de7436c0d6b7bcd66fb62b5ce3f139db"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "260d70bcc933ef2ceaba6575b6e5d6f4" -> "bf90f2691d90fd1e4ae72713a08b188b"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "e7dc79dd53d2befd070f71ec338248bf" -> "91b3614de7d5d7457e50a52e22905545"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "c3bbb19f713b88cafb6fc3f4a836f0cc" -> "839d01a4db9358a92b90d88caa0a2986"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "96cd754a691ebae1dfbdec9b0b5eadcc" -> "930263176aa789c4a95b9c2748ede0b0"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "c473d254adc846b7ad8a0171b15e6c2f" -> "3af759fbef4f1cfabedd6921fbde8694"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag               = "bb086d0e1bb147590046cdf357e0ed03" -> "67baa4f402a4b82fa9c405a4cbf5850a"
        id                 = "lambdas/demo/get_full_year_total_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "5a7f99b7d446f91792dc30925e63850b" -> "795cd39f3cfa44237a470cf05f388b81"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "66c794c7f8fa1284f46a99673b4d9473" -> "e3a224a3541346991b3fd77178ba11b3"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "c9b28da59f7f538ccc6a142177cb13a9" -> "46bbbf0978b0c807519ba6a724c7c615"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "272c0a839d74a35cd8748a7cf7053a13" -> "352dc84f19f8b8c309907ab337b438f8"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "2124c527be51ac61980fbcaed3676da7" -> "911886beec7d864b03ead850dcb689a3"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "fd6dc8c9c31e33269d179805a95350db" -> "ed3ee2a32a3bb093cf76f2d715a9b325"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "0c3cc57fe56983a4b65dbfc39bed1acd" -> "bd5f03f44cc3ca1b4bd1390c1e19221a"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "871dec6a0beb697ff82d22699e5a2a83" -> "f34f8c58f9d7be5e02a6644d3c766ebe"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "912f45c41ff0aa6fcdfda0e750443ec5" -> "9f33fa9bf56d5673d9f2382681eba848"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "7ff176fb44a4b68c7675d17bc4748f1f" -> "3e2f22c653136d0e89b6fc24bd111ada"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "0c436357a3da9b5f3935c81e08bb12bd" -> "d01ded378b40ddd291a2458abaab112e"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "24c3f8bd882347c540242ae31498b982" -> "62b8db8261c98548e54a8751acf4aada"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "415620d8a5395927d897a132edc1b8f2" -> "844bdcdcca4bb6dc044fc74f547b4da3"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "a98ee06a8e2dce011732b15b9ebbbcfa" -> "3d5f278387dbddac62d6e64b6c503d7f"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "081a7b86a6fcf68fa6fe573fecfd3d3e" -> "476a093e11fd70ecb679f1dfc710001f"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "bd89292f9c54ce37ad5231d2b252f1cd" -> "8b1ef5272309631e3e556cd8c006880e"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "edd0126229a51aba4774b5d764d72683" -> "81542410a5bdfb5c3e7bf166e34ad29f"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "1ccb452cd430d1aa6ca42a46f8e6c9f0" -> "cb947315b7fad8562582ca2544edc8ac"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "WgK47nsHj0Dw1D02uaYqKWzHsTaOIxp6VOclnEnZI6M=" -> "z299mk3uKz6YkBuUrsePIydahHQjK2o64ByLdRD6fNE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "xWA87zy2Y9BZp5EDnrGvbihQCj3d/uPqHf4oWBkSgXw=" -> "8wKnNz2kiEV4JjFn54Ae9CWiNyKQiiXvAzKnN8hgWLI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "C2cJrTk3m3mcDa3oKuKmdAV6zyigAEPhsHkF/vYymqo=" -> "wPQ4zJibeoaFTi6gskqnSWjWPAvrGgWTqtZ74VO1r+w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "4j/yTl3zSl8Xj98N2SF71sU0cgf4Hdoeh0hRBuz6WmE=" -> "+Q4QxWHkeVxZjzF5HXrjI+Sifg42xu2YYz1ZoNSTQTc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "wgkKDRBroe0Esu1dvaPG4wMMNMmpOe6gNWud05EqbEE=" -> "u6XqbGbx4DMV4pxlg+QN2fnJTmnrycbU48D1tIXnkT8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "keKE5xluyiBWRyEUPkLqz7kiJC4ht/+8f01UvPCOyIM=" -> "90rDGz3Npck/3W/WnD/7RVFuOsYF6IvONwAU/eLvX24="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "8HeBBeQ5oRD1uyH/wT/lUPXxnDyuYbSTLi4izJi9aQY=" -> "Br6kxVwJg6nlZA6kaokDfwPaIJXKEKZalilRDav1JWw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "Za8OJskPdWh9YF05PgcvMtld8AIzKncyp3B4dFtWkxE=" -> "v5LnTxs6Ag7Bsgg5PoTJmRFLhcQ514Z/EgeJv45gWzg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-01-25T21:19:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "M4gXGmCLMXqupk6wZN/KQJc53DMoy4vrce9eaxtfi8I=" -> "8U/UaZEpvL9IxrRQGKnxeANJNSs8YYlMvvl//E36RrM="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "vRm9sB70MS9C7x9Y26Y0Cccgs1pI7VVAqbr1H+cbZf0=" -> "HQfd2AH9Jq9AnNAOqM+svTQv2zy73xaqsPaaxRWIDN8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "Jm16VOPilOpL3sTRi/dEu4TPATJdINzpU66PQSbRBdE=" -> "PKSBJ/I8CXEOP4za14sWVusbqQXdExaOZ/5THiaFcO0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "hAAX9DjfnzNpvPEAD45ft2dhcIkOBbzeRRYsX10tnvk=" -> "ebkbBtI/L5Ac/yOAj2zcJyzN9LImSxZ2+fTwQK3iHlk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "a92uRQKINNEQhxFzjxpCMYpKc2mhrZT6kTVgqEJmoio=" -> "ToKMYJLXoMDupja3eLlgnlljaT09hHUDH/m9bIi7Ysc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "tgyGFB34lS/S29dvwIrmU2KdmmaP/aVf5+UmlEwNtck=" -> "zF+XtqUqmq7vghDnxrnvcZyqQ106QhFJe7KYRb+6HDs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "EbZ3AzNyS5cF9ExTnAjxXS+7NLvX82CiThJxKAb0Y6s=" -> "IdSmaQoulTkwaZDMmsO8UPmvTu8mhqw++19Bq5XQUrc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "hQZHs2P14q3/BbCAKb5N23MkncCeBxF26NK9ApxTjKU=" -> "fy8NqrRHFg1peCt+QR9+AAaeywb1QKPlQiyaEF2s6+E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "boJGkWwqxknroaImXVKRe/Jf/gJm9T1OgFL90QpXyKs=" -> "LPvZjGmHC4k0zBHahfc+Vwn/nIO4sCUx3eBGmHF4ocw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "G1Wiu8uJSYb4AxVrwOoygbAABjeeLcDGtO70brDeYqw=" -> "KlNBW1nZaA/WCnuBuYTF1IxmgJv3Ny0ypllhf3G71y4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "VGJoFbtoR5JVLJBYkgWjo4g8NqNHgy7NdYlZU6afhCA=" -> "mNa1YV/Wln/MRx/W/5KL81OP9v64UYV3ftDtgGvW2YQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-01-26T00:33:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "KUQDWkXrm/3SHAM5r2S+lul/MOzixNCk/7V8tSGbzD4=" -> "rqno2uj3d7Niaq4fQplM4BD3hgXt2lUJYgZLvQSnAco="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "F6q9DHXI/6S0ESwWw4x0gGotR++ja0RvKocNrUSv2H4=" -> "Yk0sMszn2bzwpOXJoxjNNwmPjtNfYRR/RWi3RTR6S+E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "T6trod4Mu7YdcRBFN46IqBFRkzK3Cdze3tRioUHFqNA=" -> "s3e06SSPrFnWxTS2WoTEY277zbNHkdikojAqU711fS4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "FWJsAbHzxg6Z+f7eQ9cOuv5Vjt0mUzkVbNxWmmSAwjE=" -> "HgC2m00sxwOChqvf9Wkhjzk3CVUbV1KyyLp3KSXFTs4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "htNT4jcrZi8jKazvdrEH/ddOqkZHtJLropbF2Q9K0xg=" -> "wTVUw8fKxSoC2mE1Psxx++faGSeAD0nCCre89vFIA0o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-25T23:57:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "oZWlk6u5nuOOmRJjAfmMZ3U3vJxFAuxLDzqUu/h+xLc=" -> "UAs0EhqRHJ6RFHyIRM87aDDuMGkptDAhNoYvMmObYXk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-01-26T00:00:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "yEqIWdZ04xJNYj54iMf1eoWSWIjJjxnG5hQC9MlFH6E=" -> "Iss+AfGtBkO1WYxdJchrkjFf6pnPsBciIFQzizc+WPU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "yC/h6ccSB7IhmPwNbTZAD/u3h0yG1Wumm1jLgA/JN4c=" -> "iPhTLNdIyTPiOAXpzH6312b62XdwdVsW4WyE+0XiPRQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "hehpgnaeSqt6lLge9IKvDhByzq5fdMAZijolVbFn2u0=" -> "TxqgN8K/tFKVwUQezF8Gl4fGpwxNLrlS4DRzp0WtVEY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "OexHWWmRk1Lkfg9O9mej8nJU5mik6+zZvvMgquV/WKo=" -> "fQTH1gAQAdKd9zzX816mPX9/MgGjLdeQHJ8Z1ZLlnQg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "W69/p3U/ebLRfE35XVKwfFKZS88TGJG+alM+8udfBcA=" -> "2vo6QSr0Q8UpRMEsGC9gM9mzDbzu97jioR/ywXgwr6Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "n82UeTa6m+4Q7WzO2dkG/Z4kNqZsLZVWmHBj9QoV5hA=" -> "oHaLJe8ArKDpSeA1sqEX/PtOtsFbJLf/FO9SPup5z/U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "aqhc18kZxyEQqjECAwMCvWp+RkR0g7X7lO2KsS5NNpg=" -> "mBqmrXvvqYXfUg8xYp/+1uCTrc+75rbrcCSXocQ3LmY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "x0koqkk8bU2KSXmEHeSo3/2Z09SdFrO4XCx7yXd97ak=" -> "F+1D6VXCESLBjkLLIfd7793fy8axTG6G8OMBOiZHxnY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "J9Vq/G3lRbh+Pz6BKahLT/NZS6W0bGxo6dneo776YGU=" -> "YFhWndeefVyIRpGxHUhrfJD3o/sz7soYavqLkPCnaE8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "LNYt3xRXpj0K7PmYxeDGtx7j1KwVYU6Nk7DagcV318w=" -> "9TTr1lHKR1WcxQUREe0iTjmC1cUua0Vz+T2iqbeKDKg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "9fiKCl9+XWEhkQa+lbA9H9iJwhM6xX8liToyEUhdJAc=" -> "cSfEGGo9C9cF35Dj5aE56j4JHALIrFf/mafRaX6nIso="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "QErCqljDkVSWvcAm7mcO/NzfF0ev0iZXVWhreAWLVCI=" -> "qAYVwbZ1biHMNefjFcwM1wqyfuQwF7FNZr4R6vvjzLY="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "run9azCvXCVsPqafeFT7jGPxTNOVYnS8dqUhk4zLO+8=" -> "bIl8AHRRIUhzHbSYyTp6quqSj8B7TP+1usLOw7Nkrp0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "ptETTGKf/NosJ4NY/fd1nvfuOGjqAnqogwfGeYOeMoc=" -> "V1JToADk48lXD7gcFAfiYFgvaq0T72AeiNkMH1eCCKA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "Rbi+XBtNCorEcD3vMnFuUo6uE2yMgKCSG9/D/jJrKC8=" -> "E12KeNcVbPQe+h6Apq3i5gMoYLkYNVFszLU7ocIgxuk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "srEi9SsdMVd7567pOhnOEicJ89uigfJ+aHjEatG0J8c=" -> "VpN7o31gegOVij93tAHYCic9F+ycAIcsG5fCup0GJ+o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "rYXBSNCTVlb2ia7TAiDLZRsd91Xunc4zVALvSXukojo=" -> "9fB6govcCt4+7pZkxH/k6/FTnQZ4v1CLfKbrSJim8UI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "CKQKgg2x1ksSdqapfFS+QlXthRDK8DtewJbUn09g94U=" -> "6U0X2CGcOKqJLUl+6PkvTPAkxupyPRG3PJ+F3Mhjyps="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "/r1/ZmnYNMtdXR5S8RmhLE3GJcvHkfai2kLPqtAb/gk=" -> "hKS/jgczLPnWdRftuY+b9W4bVih4dQW9ZzehzfFchuA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-01-25T21:20:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "S9uEpQsKnvEH8Ezbg0JyVZOxgCJYIEvRJS+VAjCtjWg=" -> "u4lrvkXrL4HEbK3t7/eTlFQX6ie/0jzbGy+rekfbFi4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-01-25T21:19:59Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "0w1zu0" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-01-25T21:19:58Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-01-25T21:19:58Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 93 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*